zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_BCTU.h
#define BCTU_SFTRGR2_SFTRG51_MASK                (0x80000U)
#define BCTU_SFTRGR2_SFTRG51_SHIFT               (19U)
#define BCTU_SFTRGR2_SFTRG51_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG51(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG51_SHIFT)) & BCTU_SFTRGR2_SFTRG51_MASK)

#define BCTU_SFTRGR2_SFTRG52_MASK                (0x100000U)
#define BCTU_SFTRGR2_SFTRG52_SHIFT               (20U)
#define BCTU_SFTRGR2_SFTRG52_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG52(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG52_SHIFT)) & BCTU_SFTRGR2_SFTRG52_MASK)

#define BCTU_SFTRGR2_SFTRG53_MASK                (0x200000U)
#define BCTU_SFTRGR2_SFTRG53_SHIFT               (21U)
#define BCTU_SFTRGR2_SFTRG53_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG53(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG53_SHIFT)) & BCTU_SFTRGR2_SFTRG53_MASK)

#define BCTU_SFTRGR2_SFTRG54_MASK                (0x400000U)
#define BCTU_SFTRGR2_SFTRG54_SHIFT               (22U)
#define BCTU_SFTRGR2_SFTRG54_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG54(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG54_SHIFT)) & BCTU_SFTRGR2_SFTRG54_MASK)

#define BCTU_SFTRGR2_SFTRG55_MASK                (0x800000U)
#define BCTU_SFTRGR2_SFTRG55_SHIFT               (23U)
#define BCTU_SFTRGR2_SFTRG55_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG55(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG55_SHIFT)) & BCTU_SFTRGR2_SFTRG55_MASK)

#define BCTU_SFTRGR2_SFTRG56_MASK                (0x1000000U)
#define BCTU_SFTRGR2_SFTRG56_SHIFT               (24U)
#define BCTU_SFTRGR2_SFTRG56_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG56(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG56_SHIFT)) & BCTU_SFTRGR2_SFTRG56_MASK)

#define BCTU_SFTRGR2_SFTRG57_MASK                (0x2000000U)
#define BCTU_SFTRGR2_SFTRG57_SHIFT               (25U)
#define BCTU_SFTRGR2_SFTRG57_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG57(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG57_SHIFT)) & BCTU_SFTRGR2_SFTRG57_MASK)

#define BCTU_SFTRGR2_SFTRG58_MASK                (0x4000000U)
#define BCTU_SFTRGR2_SFTRG58_SHIFT               (26U)
#define BCTU_SFTRGR2_SFTRG58_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG58(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG58_SHIFT)) & BCTU_SFTRGR2_SFTRG58_MASK)

#define BCTU_SFTRGR2_SFTRG59_MASK                (0x8000000U)
#define BCTU_SFTRGR2_SFTRG59_SHIFT               (27U)
#define BCTU_SFTRGR2_SFTRG59_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG59(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG59_SHIFT)) & BCTU_SFTRGR2_SFTRG59_MASK)

#define BCTU_SFTRGR2_SFTRG60_MASK                (0x10000000U)
#define BCTU_SFTRGR2_SFTRG60_SHIFT               (28U)
#define BCTU_SFTRGR2_SFTRG60_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG60(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG60_SHIFT)) & BCTU_SFTRGR2_SFTRG60_MASK)

#define BCTU_SFTRGR2_SFTRG61_MASK                (0x20000000U)
#define BCTU_SFTRGR2_SFTRG61_SHIFT               (29U)
#define BCTU_SFTRGR2_SFTRG61_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG61(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG61_SHIFT)) & BCTU_SFTRGR2_SFTRG61_MASK)

#define BCTU_SFTRGR2_SFTRG62_MASK                (0x40000000U)
#define BCTU_SFTRGR2_SFTRG62_SHIFT               (30U)
#define BCTU_SFTRGR2_SFTRG62_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG62(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG62_SHIFT)) & BCTU_SFTRGR2_SFTRG62_MASK)

#define BCTU_SFTRGR2_SFTRG63_MASK                (0x80000000U)
#define BCTU_SFTRGR2_SFTRG63_SHIFT               (31U)
#define BCTU_SFTRGR2_SFTRG63_WIDTH               (1U)
#define BCTU_SFTRGR2_SFTRG63(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR2_SFTRG63_SHIFT)) & BCTU_SFTRGR2_SFTRG63_MASK)
/*! @} */

/*! @name SFTRGR3 - Software Trigger 3 */
/*! @{ */

#define BCTU_SFTRGR3_SFTRG64_MASK                (0x1U)
#define BCTU_SFTRGR3_SFTRG64_SHIFT               (0U)
#define BCTU_SFTRGR3_SFTRG64_WIDTH               (1U)
#define BCTU_SFTRGR3_SFTRG64(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG64_SHIFT)) & BCTU_SFTRGR3_SFTRG64_MASK)

#define BCTU_SFTRGR3_SFTRG65_MASK                (0x2U)
#define BCTU_SFTRGR3_SFTRG65_SHIFT               (1U)
#define BCTU_SFTRGR3_SFTRG65_WIDTH               (1U)
#define BCTU_SFTRGR3_SFTRG65(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG65_SHIFT)) & BCTU_SFTRGR3_SFTRG65_MASK)

#define BCTU_SFTRGR3_SFTRG66_MASK                (0x4U)
#define BCTU_SFTRGR3_SFTRG66_SHIFT               (2U)
#define BCTU_SFTRGR3_SFTRG66_WIDTH               (1U)
#define BCTU_SFTRGR3_SFTRG66(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG66_SHIFT)) & BCTU_SFTRGR3_SFTRG66_MASK)

#define BCTU_SFTRGR3_SFTRG67_MASK                (0x8U)
#define BCTU_SFTRGR3_SFTRG67_SHIFT               (3U)
#define BCTU_SFTRGR3_SFTRG67_WIDTH               (1U)
#define BCTU_SFTRGR3_SFTRG67(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG67_SHIFT)) & BCTU_SFTRGR3_SFTRG67_MASK)

#define BCTU_SFTRGR3_SFTRG68_MASK                (0x10U)
#define BCTU_SFTRGR3_SFTRG68_SHIFT               (4U)
#define BCTU_SFTRGR3_SFTRG68_WIDTH               (1U)
#define BCTU_SFTRGR3_SFTRG68(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG68_SHIFT)) & BCTU_SFTRGR3_SFTRG68_MASK)

#define BCTU_SFTRGR3_SFTRG69_MASK                (0x20U)
#define BCTU_SFTRGR3_SFTRG69_SHIFT               (5U)
#define BCTU_SFTRGR3_SFTRG69_WIDTH               (1U)
#define BCTU_SFTRGR3_SFTRG69(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG69_SHIFT)) & BCTU_SFTRGR3_SFTRG69_MASK)

#define BCTU_SFTRGR3_SFTRG70_MASK                (0x40U)
#define BCTU_SFTRGR3_SFTRG70_SHIFT               (6U)
#define BCTU_SFTRGR3_SFTRG70_WIDTH               (1U)
#define BCTU_SFTRGR3_SFTRG70(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_SFTRGR3_SFTRG70_SHIFT)) & BCTU_SFTRGR3_SFTRG70_MASK)

